In [42]:
import pandas as pd

In [43]:
merge_dt_1 = pd.read_csv('../Data/transactionByCustomerAndItem_22.csv',iterator = True ) 
merge_dt_1

In [45]:
merge_data_1 = merge_dt_1.get_chunk(240000)

In [46]:
merge_data_1.count()

customer_id        204637
item_id            204637
quantity           204637
selling_price      204637
other_discount     204637
coupon_discount    204637
age_range          204637
marital_status     119707
rented             204637
family_size        204637
no_of_children      73958
income_bracket     204637
brand              204637
brand_type         204637
category           204637
Unnamed: 15          3033
dtype: int64

In [47]:
merge_data_1.head()

,customer_id,item_id,quantity,selling_price,other_discount,coupon_discount,age_range,marital_status,rented,family_size,no_of_children,income_bracket,brand,brand_type,category,Unnamed: 15
0,1,4315,1,201.97,0.00,0.0,70+,Married,0,2,NaN,4,2902,Established,Pharmaceutical,NaN
1,1,4577,2,120.40,0.00,0.0,70+,Married,0,2,NaN,4,115,Established,Grocery,NaN
2,1,4796,1,106.50,0.00,0.0,70+,Married,0,2,NaN,4,278,Established,Grocery,NaN
3,1,4953,4,426.72,-141.77,0.0,70+,Married,0,2,NaN,4,1061,Established,Grocery,NaN
4,1,5126,2,191.64,0.00,0.0,70+,Married,0,2,NaN,4,119,Established,Grocery,NaN

In [53]:
merge_dt_2 = pd.read_csv('../Data/transactionByCustomerAndItem_23.csv',iterator = True ) 
merge_dt_2

In [54]:
merge_data_2 = merge_dt_2.get_chunk(270000)

In [55]:
merge_data_2.count()

customer_id        247258
item_id            247258
quantity           247258
selling_price      247258
other_discount     247258
coupon_discount    247258
age_range          247258
marital_status     143753
rented             247258
family_size        247258
no_of_children      78663
income_bracket     247258
brand              247258
brand_type         247258
category           247258
Unnamed: 15          4163
dtype: int64

In [56]:
merge_data_2.head()

,customer_id,item_id,quantity,selling_price,other_discount,coupon_discount,age_range,marital_status,rented,family_size,no_of_children,income_bracket,brand,brand_type,category,Unnamed: 15
0,737,4313,1,59.84,0.0,0.0,36-45,Single,0,4,3+,4,676,Established,Grocery,NaN
1,737,4564,2,29.92,0.0,0.0,36-45,Single,0,4,3+,4,1149,Established,Pharmaceutical,NaN
2,737,4599,3,177.74,-62.7,0.0,36-45,Single,0,4,3+,4,967,Established,Grocery,NaN
3,737,4653,1,14.96,0.0,0.0,36-45,Single,0,4,3+,4,1149,Established,Pharmaceutical,NaN
4,737,4787,1,24.58,0.0,0.0,36-45,Single,0,4,3+,4,56,Local,Grocery,NaN

In [58]:
merge = pd.concat([merge_data_1, merge_data_2], axis=0)

In [61]:
merge.count()

customer_id        451895
item_id            451895
quantity           451895
selling_price      451895
other_discount     451895
coupon_discount    451895
age_range          451895
marital_status     263460
rented             451895
family_size        451895
no_of_children     152621
income_bracket     451895
brand              451895
brand_type         451895
category           451895
Unnamed: 15          7196
dtype: int64